<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ClassroomsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     * Populates the classrooms table with initial data.
     */
    public function run()
    {
        DB::table('classrooms')->insert([
            [101, 'دهم تجربی', 10, 1, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [102, 'دهم انسانی', 10, 3, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [103, 'دهم ریاضی', 10, 2, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [701, 'هفتم - دوره اول', 7, 4, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [801, 'هشتم - دوره اول', 8, 4, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [901, 'نهم - دوره اول', 9, 4, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [1101, 'یازدهم تجربی', 11, 1, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [1102, 'یازدهم انسانی', 11, 3, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [1201, 'دوازدهم تجربی', 12, 1, '2025-02-27 14:12:48', '2025-02-27 14:12:48'],
            [1202, 'دوازدهم انسانی', 12, 3, '2025-02-27 14:12:48', '2025-02-27 14:12:48']
        ]);
    }
}